# git - система управления версиями кода

# gihub - сайт, который дает хрнаилище для  кода
# также есть gitlab, bitbucket

#репозиторий - папка с проектом но на смом деле это не папка с которым может работать git

# ssh-keygen - создание ключа 
# git config --global user.name "your-name"
# git config --global user.email "your-email"
#указание своиъ данных

#git init - превратить папку в репозиторий и создает скрытую папку .git

#создается репозиторий на github
# git remote add origin <ссылка на репозиторий> - добавить ссылку на репозиорий в переменную origin

# git add либо . либо / filename - добавляет указанные файлы в индекс / начинает отслеживание файлов

# git commit -m "название для версии"- создание версии кода / создать сохранение кода

#git push origin имя_ветки - отправить версию кода на github

# git status - проверка состояния 

# git log - список коммитов
# git log -one line

# git clone <ссылка на репозиторий> - скачать проект с репозиторием / склонить проект



